/**
 * 
 */
main() {
  //Dart 支持常用的运算运算符
  print(2 + 3 == 5);
  print(2 - 3 == -1);
  print(2 * 3 == 6);
  print(5 / 2 == 2.5); // 结果是双浮点型
  print(5 ~/ 2 == 2); // 结果是整型
  print(5 % 2 == 1); // 余数
  print('5/2 = ${5 ~/ 2} r ${5 % 2}' == '5/2 = 2 r 1');

  //Dart 还支持前缀和后缀，自增和自减运算符。
  var a, b;

  a = 0;
  b = ++a; // a自加后赋值给b。
  print(a == b); // 1 == 1

  a = 0;
  b = a++; // a先赋值给b后，a自加。
  print(a != b); // 1 != 0

  a = 0;
  b = --a; // a自减后赋值给b。
  print(a == b); // -1 == -1

  a = 0;
  b = a--; // a先赋值给b后，a自减。
  print(a != b); // -1 != 0
}
